nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_flexio.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       		Notes
 * 2020-04-13     Tony.Zhang(NXP)	
 *
 */

#include <rtthread.h>
#include <rtdevice.h>
#ifdef SOC_IMXRT1170_SERIES
#else
#include "fsl_csi_camera_adapter.h"
#include "fsl_camera.h"
#include "fsl_camera_receiver.h"
#include "fsl_camera_device.h"
#include "fsl_flexio_camera.h"
#include "fsl_ov7725.h"
#endif
#include "fsl_elcdif.h"
#include "fsl_edma.h"
#include "fsl_dmamux.h"
#include "fsl_cache.h"
#include "fsl_gpio.h"
#include "fsl_clock.h"
#include "fsl_csi.h"
#include "py/mpprint.h"
#include "irq.h"
#include "sensor.h"
#include "drv_camera.h"
#include "ov9650.h"
#include "ov2640.h"
#include "ov5640.h"
#include "ov5640_regs.h"
#include "ov7725.h"
#include "ov7725_regs.h"
#include "mt9v034.h"
#include "framebuffer.h"


#define cam_echo(...) //mp_printf(MP_PYTHON_PRINTER, __VA_ARGS__)
#define cam_err(...) mp_printf(MP_PYTHON_PRINTER, __VA_ARGS__)

#if defined(__CC_ARM) || defined(__CLANG_ARM)
//	extern unsigned int Image$$MPY_SENSOR_BUFER_START$$Base;
//	extern unsigned int Image$$MPY_SENSOR_BUFER_START$$Limit;
#elif defined(__ICCARM__)
	extern unsigned int MPY_SENSOR_BUFER_START$$Limit[];
#elif defined(__GNUC__)

#endif


enum{
	RT_CAMERA_DEVICE_INIT = 0,
	RT_CAMERA_DEVICE_SUSPEND,
	RT_CAMERA_DEVICE_RUNING,
}RT_CAMERA_DEVICE_ST;


#define FB_MEM_HEAD_SIZE   (2*sizeof(uint32_t))

struct imxrt_camera
{
    char *name;
    
    
	struct rt_camera_device *rtt_device;

    uint32_t flexio_base ;
    FLEXIO_CAMERA_Type FlexioCameraDevice;
    flexio_camera_config_t FlexioCameraConfig;
    edma_config_t edma_config;
    edma_handle_t g_EDMA_Handle;
    edma_transfer_config_t transferConfig;
    IRQn_Type irqn;
	sensor_t	sensor;
    GPIO_Type * vSyncgpio;
	uint8_t     vSyncpin;
    rt_base_t    vSyncRTTpin;
	uint32_t LineCount;
	uint32_t LineBytes;
	
	
	uint16_t	sensor_id;
	uint8_t     sensor_addr;
	GPIO_Type * sensor_pwn_io;
	uint8_t     sensor_pwn_io_pin;
	GPIO_Type *  sensor_rst_io;
	uint8_t sensor_rst_io_pin;
	char 		*sensor_bus_name;
	uint32_t	fb_buffer_start;
	uint32_t	fb_buffer_end;
};

const uint16_t supported_sensors[3][2] = {
	{0x21,OV_CHIP_ID},//ov7725
	{0x48,0x00},//mt9m114
	{OV5640_SLV_ADDR>>1,OV5640_CHIP_ID}
};

static struct imxrt_camera *pCam = NULL;
#define CAM_NUM		1
#ifndef BSP_SENSOR2_BUS_NAME
#define BSP_SENSOR2_BUS_NAME "CAM2_I2C"
#endif
static struct imxrt_camera cams[1] = {
	{
		.name = "camera0",
		.sensor_id = 0,
		.sensor_addr = 0x42U,
		
		.sensor_bus_name = BSP_SENSOR2_BUS_NAME,
	}

};


const int resolution[][2] = {
    {0,    0   },
    // C/SIF Resolutions
    {88,   72  },    /* QQCIF     */
    {176,  144 },    /* QCIF      */
    {352,  288 },    /* CIF       */
    {88,   60  },    /* QQSIF     */
    {176,  120 },    /* QSIF      */
    {352,  240 },    /* SIF       */
    // VGA Resolutions
    {40,   30  },    /* QQQQVGA   */
    {80,   60  },    /* QQQVGA    */
    {160,  120 },    /* QQVGA     */
    {320,  240 },    /* QVGA      */
    {640,  480 },    /* VGA       */
    {60,   40  },    /* HQQQVGA   */
    {120,  80  },    /* HQQVGA    */
    {240,  160 },    /* HQVGA     */
    // FFT Resolutions
    {64,   32  },    /* 64x32     */
    {64,   64  },    /* 64x64     */
    {128,  64  },    /* 128x64    */
    {128,  128 },    /* 128x64    */
    // Other
    {128,  160 },    /* LCD       */
    {128,  160 },    /* QQVGA2    */
    {720,  480 },    /* WVGA      */
    {752,  480 },    /* WVGA2     */
    {800,  600 },    /* SVGA      */
    {1024, 768 },    /* XGA       */
    {1280, 1024},    /* SXGA      */
    {1600, 1200},    /* UXGA      */
	{1280, 720 },    /* HD        */ 
    {1920, 1080},    /* FHD       */ 
    {2560, 1440},    /* QHD       */
    {2048, 1536},    /* QXGA      */
    {2560, 1600},    /* WQXGA     */
    {2592, 1944},    /* WQXGA2    */
};

#define FLEXIO_CAMERA_DMA_CHN           0u
#define FLEXIO_CAMERA_DMA_MUX_SRC       (kDmaRequestMuxFlexIO1Request0Request1 & 0xFF)

#define FXIO_SHFT_COUNT     1u
#define DMA_CHN             0u
#define DMA_MUX_SRC         kDmaRequestMuxFlexIO1Request0Request1

#define FRAMEBUFFER_SIZE (640*480*2)
#define FRAMEBUFFER_COUNT 3
#define FRAGBUF_LOC  __attribute__((section(".dmaFramebuffer")))
extern char Image$$CAM_FRAME_BUFFER$$Base;
FRAGBUF_LOC static uint32_t *s_dmaFragBufs[2];	// max supported line length, XRGB8888(*4)
uint32_t pFlexioCameraFrameBuffer = 0;
static struct rt_event frame_event;
#define EVENT_CSI	(1<<0)

static uint32_t g_csi_int_en = 0;
static uint32_t isToStopCSICommand = 0;
static rt_timer_t g_csi_to = NULL;
static uint32_t g_csi_to_ticks = 1500;
bool csi_calc_first = 0;
//==================================================================================================
#ifdef RT_USING_LCD
extern void LCDMonitor_Update(uint32_t fbNdx, uint8_t isGray,uint32_t wndH, uint32_t wndW, uint32_t pixels_addr);
#endif

void imx_cam_csi_start_frame(struct imxrt_camera *cam);

void imx_cam_sensor_io_init(GPIO_Type *base, uint32_t pin)
{
    gpio_pin_config_t config = {
        kGPIO_DigitalOutput, 0,
    };
	
	GPIO_PinInit(base, pin, &config);	
}

static void imx_cam_sensor_io_set(GPIO_Type *base, uint32_t pin,bool pullUp)
{
    if (pullUp)
    {
        GPIO_PinWrite(base, pin, 1);
    }
    else
    {
        GPIO_PinWrite(base, pin, 0);
    }
}

uint8_t imx_cam_sensor_scan(struct rt_i2c_bus_device *i2c_bus)
{
	struct rt_i2c_msg msgs;
	rt_uint8_t buf[3] = {0};
	for (uint8_t addr=0x08;addr<=0x77;addr++)
	{
		buf[0] = 0x0; //cmd
		msgs.addr = addr;
		msgs.flags = RT_I2C_WR;
		msgs.buf = buf;
		msgs.len = 1;
		
		if (rt_i2c_transfer(i2c_bus, &msgs, 1) != 0)
		{
			return addr ;
		}
	}
	
	return 0;
}

int imx_cam_sensor_read_reg(struct rt_i2c_bus_device *i2c_bus,rt_uint16_t addr, rt_uint8_t reg, rt_uint8_t *data)
{
	struct rt_i2c_msg msgs[2];
	rt_uint8_t buf[3];
	
	
	buf[0] = reg; //cmd
    msgs[0].addr = addr;
    msgs[0].flags = RT_I2C_WR;
    msgs[0].buf = buf;
    msgs[0].len = 1;
	
	msgs[1].addr = addr;
    msgs[1].flags = RT_I2C_RD|RT_I2C_NO_START;
    msgs[1].buf = data;
    msgs[1].len = 1;
	
//	count = rt_i2c_master_send(i2c_bus,addr,0,buf,1);
//	count = rt_i2c_master_recv(i2c_bus,addr,RT_I2C_NO_START,data,1);
    
	
