nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_flexio.c
    /* set the frame rate */
    cam->sensor.framerate = framerate;

    return 0;
}

void imx_cam_flexio_mclk_init()
{
	flexio_timer_config_t timerConfig;

    timerConfig.triggerSelect = 0u;
    timerConfig.triggerPolarity = kFLEXIO_TimerTriggerPolarityActiveHigh;
    timerConfig.triggerSource = kFLEXIO_TimerTriggerSourceInternal;
    timerConfig.pinConfig = kFLEXIO_PinConfigOutput;
    timerConfig.pinSelect = 12;
    timerConfig.pinPolarity = kFLEXIO_PinActiveHigh;
    timerConfig.timerMode = kFLEXIO_TimerModeDual8BitPWM;
    timerConfig.timerOutput = kFLEXIO_TimerOutputZeroNotAffectedByReset;
    timerConfig.timerDecrement = kFLEXIO_TimerDecSrcOnFlexIOClockShiftTimerOutput;
    timerConfig.timerReset = kFLEXIO_TimerResetNever;
    timerConfig.timerDisable = kFLEXIO_TimerDisableNever;
    timerConfig.timerEnable = kFLEXIO_TimerEnabledAlways;
    timerConfig.timerStop = kFLEXIO_TimerStopBitDisabled;
    timerConfig.timerStart = kFLEXIO_TimerStartBitDisabled;
    timerConfig.timerCompare = 0x201; /* 120MHz clock source generates 24MHz clock.*/

    FLEXIO_SetTimerConfig(FLEXIO1, 1u, &timerConfig);
}

void imx_cam_flexio_hclk_init()
{
	 flexio_timer_config_t timerConfig;

    timerConfig.triggerSelect = FLEXIO_TIMER_TRIGGER_SEL_PININPUT(8);;
    timerConfig.triggerPolarity = kFLEXIO_TimerTriggerPolarityActiveLow;
    timerConfig.triggerSource = kFLEXIO_TimerTriggerSourceInternal;
    timerConfig.pinConfig = kFLEXIO_PinConfigOutputDisabled;
    timerConfig.pinSelect = 8;
    timerConfig.pinPolarity = kFLEXIO_PinActiveHigh;
    timerConfig.timerMode = kFLEXIO_TimerModeDual8BitBaudBit;
    timerConfig.timerOutput = kFLEXIO_TimerOutputZeroNotAffectedByReset;
    timerConfig.timerDecrement = kFLEXIO_TimerDecSrcOnPinInputShiftPinInput;
    timerConfig.timerReset = kFLEXIO_TimerResetOnTimerTriggerRisingEdge;
    timerConfig.timerDisable = kFLEXIO_TimerDisableOnTimerCompare;
    timerConfig.timerEnable = kFLEXIO_TimerEnableOnTriggerRisingEdge;
    timerConfig.timerStop = kFLEXIO_TimerStopBitDisabled;
    timerConfig.timerStart = kFLEXIO_TimerStartBitDisabled;
    timerConfig.timerCompare = 0x0001;

    FLEXIO_SetTimerConfig(FLEXIO1, 2u, &timerConfig);
    FLEXIO_EnableTimerStatusInterrupts(FLEXIO1, 1<<2u);
}

void imx_cam_flexio_init(struct imxrt_camera *cam, bool isWindowing)
{
	cam->FlexioCameraDevice.flexioBase = FLEXIO1;                 
    cam->FlexioCameraDevice.datPinStartIdx = 0;     
    cam->FlexioCameraDevice.pclkPinIdx = 10;          
    cam->FlexioCameraDevice.hrefPinIdx = 8;          
    cam->FlexioCameraDevice.shifterStartIdx = 0;   
    cam->FlexioCameraDevice.shifterCount = 8;        
    cam->FlexioCameraDevice.timerIdx = 0;                        

    CLOCK_EnableClock(kCLOCK_Flexio1);
    FLEXIO_Reset(FLEXIO1);

    FLEXIO_CAMERA_GetDefaultConfig(&cam->FlexioCameraConfig);
    FLEXIO_CAMERA_Init(&cam->FlexioCameraDevice, &cam->FlexioCameraConfig);
    FLEXIO_CAMERA_ClearStatusFlags(&cam->FlexioCameraDevice, kFLEXIO_CAMERA_RxDataRegFullFlag | kFLEXIO_CAMERA_RxErrorFlag);
	
	imx_cam_flexio_mclk_init();
	
	if(isWindowing)
		imx_cam_flexio_hclk_init();
	
    FLEXIO_CAMERA_Enable(&cam->FlexioCameraDevice, true);
	
	
}


extern void BOARD_FlexIOCam_pwd_io_set(int value);
extern void BORAD_FlexIOCam_rst_io_set(int value);
extern void BORAD_FlexIOCam_get_vsyncio(uint32_t *base, uint8_t *pin,rt_base_t *rttPin);
bool imx_cam_sensor_init(struct imxrt_camera *cam)
{
	struct rt_i2c_bus_device *i2c_bus;
	

	
	i2c_bus = rt_i2c_bus_device_find((const char *)cam->sensor_bus_name);
	if(i2c_bus == RT_NULL)
	{
		cam_err("[%s]driver can not find %s bus\r\n",__func__,cam->sensor_bus_name);
		return false;
	}
	
	CLOCK_SetMux(kCLOCK_Flexio1Mux, 3);
    CLOCK_SetDiv(kCLOCK_Flexio1PreDiv, 1);
    CLOCK_SetDiv(kCLOCK_Flexio1Div, 3);
	
    BORAD_FlexIOCam_get_vsyncio((uint32_t *)(&cam->vSyncgpio),&cam->vSyncpin,&cam->vSyncRTTpin);
	imx_cam_flexio_init(cam, 0);
	cam_err("csi root clk:%d\r\n",CLOCK_GetClockRootFreq(kCLOCK_Flexio1ClkRoot));
	for (int i=0; i< 3;i++)
	{
		cam->sensor.i2c_bus = (uint32_t *)i2c_bus;
		cam->sensor.cambus_readb = imx_cam_sensor_cambus_readb;
		cam->sensor.cambus_writeb = imx_cam_sensor_cambus_writeb;
		cam->sensor.cambus_readw = imx_cam_sensor_cambus_readw;
		cam->sensor.cambus_writew = imx_cam_sensor_cambus_writew;
		cam->sensor.cambus_readb2 = imx_cam_sensor_cambus_readb2;
		cam->sensor.cambus_writeb2 = imx_cam_sensor_cambus_writeb2;
		cam->sensor.cambus_writews = imx_cam_sensor_cambus_writews;
		cam->sensor.cambus_readws = imx_cam_sensor_cambus_readws;
		cam->sensor_addr = supported_sensors[i][0];
		cam->sensor.slv_addr = cam->sensor_addr;

		
		//reset camera
		//power down to low
		BOARD_FlexIOCam_pwd_io_set(0);
		//reset 
		BORAD_FlexIOCam_rst_io_set(0);
		rt_thread_delay(50);
		BORAD_FlexIOCam_rst_io_set(1);
		rt_thread_delay(50);

		//read 2 bytes first for mt9m114
		uint16_t sensor_id_s = 0;
		uint8_t sensor_id = 0;
		if(imx_cam_sensor_cambus_readw2(&cam->sensor,cam->sensor_addr,supported_sensors[i][1], &sensor_id_s) == 0)
		{//two bytes addr, two bytes value
			if(sensor_id_s == MT9M114_ID)
			{
				cam_err("Camera Device id:0x%x\r\n",sensor_id_s);
				mt9m114_init(&cam->sensor);
				cam->sensor_id = MT9M114_ID;
				return true;
			}
		}
		
		if (imx_cam_sensor_readb2_reg(i2c_bus,cam->sensor_addr,supported_sensors[i][1], &sensor_id) == 0)
		{//two byte addr, one bytes value
			if(sensor_id == OV5640_ID)
			{
				cam_err("Camera Device id:0x%x\r\n",sensor_id);
				#ifdef SENSOR_OV5640
				ov5640_init(&cam->sensor);
				#endif
				cam->sensor_id = OV5640_ID;
				return true;
			}
		}
		
		if (imx_cam_sensor_read_reg(i2c_bus,cam->sensor_addr,OV_CHIP_ID, &sensor_id) == 0)
		{//one byte addr. one byte value
			switch(sensor_id)
			{

				case OV9650_ID:
					cam_err("Camera Device id:0x%x\r\n",sensor_id);
					#ifdef SENSOR_OV9650
					ov9650_init(&cam->sensor);
					#endif
					cam->sensor_id = OV9650_ID;
					return true;
				case OV2640_ID:
					cam_err("Camera Device id:0x%x\r\n",sensor_id);
					#ifdef SENSOR_OV2640
					ov2640_init(&cam->sensor);
					#endif
					cam->sensor_id = OV2640_ID;
					return true;
				case OV7725_ID:
					cam_err("Camera Device id:0x%x\r\n",sensor_id);
					#ifdef SENSOR_OV7725
					ov7725_init(&cam->sensor);
					cam->sensor_id = OV7725_ID;
					imxrt_camera_set_framerate(cam,0x80000000 | (2<<9|(8-1)<<11));
					#endif
					
