nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_flexio.c
					return true;
				default:
					
					break;
			}
		
		}
	}
	cam_err("[%s] sensor id:0x%2x not support\r\n",__func__,cam->sensor_id);
	return false;
}



void imx_cam_reset(struct imxrt_camera *cam)
{
	mutex_init0(&JPEG_FB()->lock);
	//sensor init
	imx_cam_sensor_init(cam);
	
	csi_calc_first = 0;
	cam->sensor.isWindowing = 0;
	cam->sensor.wndH = cam->sensor.fb_h;
	cam->sensor.wndW = cam->sensor.fb_w;
	cam->sensor.wndX = cam->sensor.wndY = 0;	
	
	cam->sensor.sde          = 0xFF;
    cam->sensor.pixformat    = 0xFF;
    cam->sensor.framesize    = 0xFF;
    cam->sensor.framerate    = 0xFF;
    cam->sensor.gainceiling  = 0xFF;


    // Call sensor-specific reset function; in the moment,we use our init function and defaults regs
    if (cam->sensor.reset)
		cam->sensor.reset(&cam->sensor);
}



#if defined(__CC_ARM)
#define ARMCC_ASM_FUNC	__asm
ARMCC_ASM_FUNC __attribute__((section(".ram_code"))) uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	push	{r4-r7, lr}
10
	LDMIA	R0!, {r3-r6}
	// schedule code carefully to allow dual-issue on Cortex-M7
	bfi		r7, r3, #0, #8	// Y0
	bfi		ip, r5, #0, #8	// Y4
	lsr		r3,	r3,	#16
	lsr		r5,	r5,	#16
	bfi		r7, r3, #8, #8	// Y1
	bfi		ip, r5, #8, #8  // Y5
	bfi		r7, r4, #16, #8 // Y2
	bfi		ip, r6, #16, #8 // Y6
	lsr		r4,	r4,	#16
	lsr		r6,	r6,	#16
	bfi		r7, r4, #24, #8 // Y3
	bfi		ip, r6, #24, #8	// Y7
	STMIA	r1!, {r7, ip}
	
	subs	r2,	#1
	bne		%b10
	mov		r0,	r1
	pop		{r4-r7, pc}
}
#elif defined(__CLANG_ARM)
__attribute__((section(".ram_code")))
__attribute__((naked))  uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
		__asm volatile (
		"	push	{r1-r7, ip, lr}  \n "
		"10:  \n "
		"	ldmia	r0!, {r3-r6}  \n "
			// schedule code carefully to allow dual-issue on Cortex-M7
		"	bfi		r7, r3, #0, #8  \n "	// Y0
		"	bfi		ip, r5, #0, #8  \n "	// Y4
		"	lsr		r3,	r3,	#16  \n "
		"	lsr		r5,	r5,	#16  \n "
		"	bfi		r7, r3, #8, #8  \n "	// Y1
		"	bfi		ip, r5, #8, #8  \n "  // Y5
		"	bfi		r7, r4, #16, #8  \n " // Y2
		"	bfi		ip, r6, #16, #8  \n " // Y6
		"	lsr		r4,	r4,	#16  \n "
		"	lsr		r6,	r6,	#16  \n "
		"	bfi		r7, r4, #24, #8  \n " // Y3
		"	bfi		ip, r6, #24, #8  \n "	// Y7
		"	stmia	r1!, {r7, ip}  \n "	
		"	subs	r2,	#1  \n "
		"	bne		10b  \n "
		"	mov		r0,	r1  \n "
		"	pop		{r1-r7, ip, pc}  \n "		
	);
}
#else
__attribute__((naked))
__attribute__((section(".ram_code"))) uint32_t ExtractYFromYuv(uint32_t dmaBase, uint32_t datBase, uint32_t _128bitUnitCnt) {
	__asm volatile (
		"	push	{r1-r7, ip, lr}  \n "
		"10:  \n "
		"	ldmia	r0!, {r3-r6}  \n "
			// schedule code carefully to allow dual-issue on Cortex-M7
		"	bfi		r7, r3, #0, #8  \n "	// Y0
		"	bfi		ip, r5, #0, #8  \n "	// Y4
		"	lsr		r3,	r3,	#16  \n "
		"	lsr		r5,	r5,	#16  \n "
		"	bfi		r7, r3, #8, #8  \n "	// Y1
		"	bfi		ip, r5, #8, #8  \n "  // Y5
		"	bfi		r7, r4, #16, #8  \n " // Y2
		"	bfi		ip, r6, #16, #8  \n " // Y6
		"	lsr		r4,	r4,	#16  \n "
		"	lsr		r6,	r6,	#16  \n "
		"	bfi		r7, r4, #24, #8  \n " // Y3
		"	bfi		ip, r6, #24, #8  \n "	// Y7
		"	stmia	r1!, {r7, ip}  \n "	
		"	subs	r2,	#1  \n "
		"	bne		10b  \n "
		"	mov		r0,	r1  \n "
		"	pop		{r1-r7, ip, pc}  \n "		
	);
}

#endif

__attribute__((section(".ram_code")))
__attribute__((naked)) void rgb32Torgb565(uint32_t *src, uint16_t *dst, uint32_t len){
	__asm volatile(
		"push {r3-r8, lr}\n"
		"loop: \n"
		"mov r8, #0\n"
		"ldrd r3,r4, [r0], #8\n"
	
		"ubfx r5, r3, #0, #8\n" //r1
		"lsr r5, #3\n"	
		"ubfx r6, r3, #8, #8\n" //g1
		"lsr r6, #2\n"
		"orr r8, r8, r5\n"
		"ubfx r7, r3, #16, #8\n" //b1
		"orr r8, r8, r6, LSL #5\n"	
		"lsr r7, #3\n"

	
		"ubfx r5, r4, #0, #8\n" //r1
		"orr r8, r8, r7, LSL #11\n"
		"lsr r5, #3\n"	
		"ubfx r6, r4, #8, #8\n" //g1
		"lsr r6, #2\n"
		"orr r8, r8, r5, LSL #16\n"
		"ubfx r7, r4, #16, #8\n" //b1
		"orr r8, r8, r6, LSL #21\n"	
		"lsr r7, #3\n"
		"orr r8, r8, r7, LSL #27\n"
			
		"rev16 r8, r8\n"
		"subs r2, 8\n"
		"str r8, [r1], #4\n"
		"bne loop\n"
		"pop {r3-r8, pc}\n"
		);
}
void rgb32Torgb565_c(uint32_t *src, uint16_t *dst, uint32_t len){
	uint8_t r,g,b;
	for(int i=0;i<len;i+=4){
		uint32_t col = *(src++);
		r = (col>>16) & 0xff;
		g = (col>>8) & 0xff;
		b = col & 0xff;
		*dst++ = ((r >> 3) << 11) | ((g>>2)<<5) | ((b>>3));	
	}
}

__attribute__((naked)) void copy2mem(void* dst, void* src, uint32_t len){
	__asm volatile(
		"push {r3-r4, lr}\n"
		"loop1: \n"
		"ldrd r3, r4, [r1], #8\n"
		"strd r3, r4, [r0], #8\n"
		"subs r2, #8\n"
		"bne loop1\n"
		"pop {r3-r4, lr}\n"
		);
}

__attribute__((naked)) static void unaligned_memcpy_rev16(uint16_t *dst, uint16_t *src, uint32_t u64Cnt){
	__asm volatile(
		"	push {r3, r4} \n"
		"loop2: \n"
		"	ldrd r3, r4, [r1], #8 \n"
		"	rev16 r3, r3 \n"
		"	rev16 r4, r4 \n"
		"	strd r3, r4, [r0], #8 \n"
		"	subs r2, #1 \n"
		"	bne loop2 \n"
		"	pop {r3, r4} \n"
		"	bx lr ");
	
}

static uint64_t rt_tick_get_us(){
	uint64_t tick = rt_tick_get();
	uint64_t us = 1000000 * (SysTick->LOAD - SysTick->VAL) / (SystemCoreClock);
	us += tick * 1000;
	return us;
}
uint32_t g_start,g_s1,g_e1, g_csi_end;
uint64_t g_csi_start, g_exit;
static int sync_found = 0;


void flexio_camera_dma_cb(edma_handle_t *handle, void *param, bool transferDone, uint32_t tcds)
{
	struct imxrt_camera *cam = (struct imxrt_camera *)param;
    vbuffer_t *buffer = framebuffer_get_tail(FB_NO_FLAGS);
        
    if (!buffer) 
    {
        framebuffer_flush_buffers();
        buffer = framebuffer_get_tail(FB_NO_FLAGS);
    }

    if(!buffer)
        return;
/*
    if (pCam->s_irq.isGray || 
			(pCam->sensor.isWindowing &&  lineNdx >= pCam->sensor.wndY && lineNdx - pCam->sensor.wndY <= pCam->sensor.wndH) )
    {

        dmaBase += pCam->sensor.wndX * 2 * pCam->s_irq.linePerFrag;	// apply line window offset
        if (pCam->s_irq.isGray) {
            
            pCam->s_irq.datCurBase = ExtractYFromYuv(s_dmaFragBufs, buffer->data, (cam->sensor.framebytes) >> 3);
        
        } else {
           memcpy(buffer->data,s_dmaFragBufs,cam->sensor.framebytes);
        }
    }
    else
*/
    {
        
