nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_flexio.c
        memcpy(buffer->data,(void*)pFlexioCameraFrameBuffer,cam->sensor.framebytes);
    }

    rt_event_send(&frame_event, EVENT_CSI);
}



void FLEXIO_CameraFrameEnd(struct imxrt_camera *cam)
{
    FLEXIO_CAMERA_ClearStatusFlags(&cam->FlexioCameraDevice,
                                   kFLEXIO_CAMERA_RxDataRegFullFlag | kFLEXIO_CAMERA_RxErrorFlag);

    
}

void FLEXIO_CameraLineStart(struct imxrt_camera *cam)
{
    if(cam->LineCount < cam->sensor.fb_h)
    {
        DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].DADDR = (uint32_t)pFlexioCameraFrameBuffer + cam->LineBytes * cam->LineCount;
        DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].CITER_ELINKNO = (cam->LineBytes / 32u);
        DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].BITER_ELINKNO = (cam->LineBytes / 32u);
        DMA0->SERQ = DMA_SERQ_SERQ(FLEXIO_CAMERA_DMA_CHN);
        cam->LineCount++;
    }
}

void FLEXIO_CameraFrameStart(struct imxrt_camera *cam)
{
    if(pFlexioCameraFrameBuffer == (uint32_t)s_dmaFragBufs[1])
    {
        pFlexioCameraFrameBuffer = (uint32_t)s_dmaFragBufs[0];
    }
    else
    {
        pFlexioCameraFrameBuffer = (uint32_t)s_dmaFragBufs[1];
    }
	
	DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].DADDR = (uint32_t)pFlexioCameraFrameBuffer;
	DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].CITER_ELINKNO = (cam->sensor.framebytes / 32u);
	DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].BITER_ELINKNO = (cam->sensor.framebytes / 32u);
	DMA0->SERQ = DMA_SERQ_SERQ(FLEXIO_CAMERA_DMA_CHN);
    cam->LineCount = 0;
    //FLEXIO_CameraLineStart(cam);
}

void FLEXIO1_IRQHandler(void)
{
	if (pCam == NULL)
		return;
	
    FLEXIO_ClearTimerStatusFlags(FLEXIO1, 1<<2u);
    FLEXIO_CameraLineStart(pCam);
    __DSB();
}

void vSync_isr_handler(void *arg)
{
	struct imxrt_camera *cam = (struct imxrt_camera *)arg;
	
	#if 1
	
    FLEXIO_CameraFrameEnd(cam);

    vbuffer_t *buffer = framebuffer_get_tail(FB_NO_FLAGS);
        
    if (!buffer) 
    {
        framebuffer_flush_buffers();
        buffer = framebuffer_get_tail(FB_NO_FLAGS);
    }

    if(!buffer)
        return;
	
	if(pFlexioCameraFrameBuffer > 0) {
		memcpy(buffer->data,(void*)pFlexioCameraFrameBuffer,cam->sensor.framebytes);
		rt_event_send(&frame_event, EVENT_CSI);
	}
    FLEXIO_CameraFrameStart(cam);	
	#else
	
	
	int dma_chn = cam->g_EDMA_Handle.channel;
	
	if(pFlexioCameraFrameBuffer == (uint32_t)s_dmaFragBufs[1])
    {
        pFlexioCameraFrameBuffer = (uint32_t)s_dmaFragBufs[0];
    }
    else
    {
        pFlexioCameraFrameBuffer = (uint32_t)s_dmaFragBufs[1];
    }
	
    // void dma_restart(uint8 *dest_addr)
    DMA0->TCD[dma_chn].DADDR = (uint32_t)(pFlexioCameraFrameBuffer);
    // flexio_flag_clear();
    FLEXIO_CAMERA_ClearStatusFlags(&cam->FlexioCameraDevice, kFLEXIO_CAMERA_RxDataRegFullFlag | kFLEXIO_CAMERA_RxErrorFlag);
    DMA0->SERQ = DMA_SERQ_SERQ(dma_chn);
	
	#endif
    __DSB();
}

static void configDMA(struct imxrt_camera *cam)
{
#if 1
	 /* Configure DMA TCD */
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].SADDR = FLEXIO_CAMERA_GetRxBufferAddress(&cam->FlexioCameraDevice);
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].SOFF = 0u;
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].ATTR = DMA_ATTR_SMOD(0u) |
                                            DMA_ATTR_SSIZE(8u) |
                                            DMA_ATTR_DMOD(0u) |
                                            DMA_ATTR_DSIZE(8u);
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].NBYTES_MLNO = 32u;
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].SLAST = 0u;
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].DOFF = 32u;
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].DLAST_SGA = 0;
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].CSR = 0u;
    DMA0->TCD[FLEXIO_CAMERA_DMA_CHN].CSR |= DMA_CSR_DREQ_MASK;

    /* Configure DMA MUX Source */
    DMAMUX->CHCFG[FLEXIO_CAMERA_DMA_CHN] = DMAMUX->CHCFG[FLEXIO_CAMERA_DMA_CHN] &
                                            (~DMAMUX_CHCFG_SOURCE_MASK) | 
                                            DMAMUX_CHCFG_SOURCE(FLEXIO_CAMERA_DMA_MUX_SRC);
    /* Enable DMA channel. */
    DMAMUX->CHCFG[FLEXIO_CAMERA_DMA_CHN] |= DMAMUX_CHCFG_ENBL_MASK;
#else	
    int dma_chn = DMA_CHN;  // Default
	edma_modulo_t s_addr_modulo;
	
	DMAMUX_Deinit(DMAMUX);
	DMAMUX_Init(DMAMUX);
	DMAMUX_SetSource(DMAMUX, DMA_CHN, DMA_MUX_SRC);
	DMAMUX_EnableChannel(DMAMUX, DMA_CHN);
	
	EDMA_CreateHandle(&cam->g_EDMA_Handle, DMA0, dma_chn);
	EDMA_SetCallback(&cam->g_EDMA_Handle, flexio_camera_dma_cb, NULL);
	EDMA_PrepareTransfer(&cam->transferConfig, 
							(void *)FLEXIO_CAMERA_GetRxBufferAddress(&cam->FlexioCameraDevice), 
							1,
							(void *)(s_dmaFragBufs), 
							4,
							1*FXIO_SHFT_COUNT,
							cam->LineBytes,
							kEDMA_MemoryToMemory);

	EDMA_SubmitTransfer(&cam->g_EDMA_Handle, &cam->transferConfig);

	switch(4*FXIO_SHFT_COUNT)
	{
		case 4:     s_addr_modulo = kEDMA_Modulo4bytes;break;
		case 8:     s_addr_modulo = kEDMA_Modulo8bytes;break;
		case 16:    s_addr_modulo = kEDMA_Modulo16bytes;break;
		case 32:    s_addr_modulo = kEDMA_Modulo32bytes;break;
		default:assert(0); 
	}

	EDMA_SetModulo(DMA0, dma_chn, s_addr_modulo, kEDMA_ModuloDisable);
	EDMA_StartTransfer(&cam->g_EDMA_Handle);
    
#endif    
	// flexio_enable_rxdma()
	FLEXIO_CAMERA_EnableRxDMA(&cam->FlexioCameraDevice, true);
	
	NVIC_SetPriority(DMA0_DMA16_IRQn, IRQ_PRI_CSI);            
}

void imx_cam_csi_start_frame(struct imxrt_camera *cam)
{//flexio	
	uint32_t start = rt_tick_get_us();
	edma_config_t edmaConfig;
	
	pCam = cam;
	
	DMAMUX_Init(DMAMUX);
    EDMA_GetDefaultConfig(&edmaConfig);
    edmaConfig.enableDebugMode = true;
    EDMA_Init(DMA0, &edmaConfig);
	
    imx_cam_flexio_init(cam, 0);
	
    configDMA(cam);

    // 设置场中断
    rt_pin_mode(cam->vSyncRTTpin, PIN_MODE_INPUT_PULLUP);
    rt_pin_attach_irq(cam->vSyncRTTpin, PIN_IRQ_MODE_FALLING, vSync_isr_handler, (void*)cam);
    rt_pin_irq_enable(cam->vSyncRTTpin, PIN_IRQ_ENABLE);

    NVIC_SetPriority(FLEXIO1_IRQn, IRQ_PRI_CSI); 
	EnableIRQ(FLEXIO1_IRQn);
	
}

void imx_cam_start_snapshot(struct imxrt_camera *cam)
{
	pCam = cam;
	//start csi
	uint8_t bpp=2;
	int16_t w,h;
	uint32_t size;
	
	w = cam->sensor.isWindowing ? cam->sensor.fb_w : resolution[cam->sensor.framesize][0];
	h = cam->sensor.isWindowing ? cam->sensor.fb_h : resolution[cam->sensor.framesize][1];
	switch (cam->sensor.pixformat) {
        case PIXFORMAT_GRAYSCALE:
            bpp = 1;
            break;
        case PIXFORMAT_YUV422:
        case PIXFORMAT_RGB565:
            bpp = 2;
            break;
        case PIXFORMAT_BAYER:
            bpp = 3;
            break;
        case PIXFORMAT_JPEG:
            // Read the number of data items transferred
            // MAIN_FB()->bpp = (MAX_XFER_SIZE - __HAL_DMA_GET_COUNTER(&DMAHandle))*4;
            break;
		default:
			bpp = 2;
			break;
    }
	
